{
    "data": [
      {
        "type": "artist",
        "id": "c879e992-1443-4eab-b124-d18c773bbc63",
        "attributes": {
          "nid": 191,
          "name": "Lemon Bucket Orchestra",
          "created": "2022-08-04T18:56:42+00:00",
          "changed": "2023-12-06T09:06:29+00:00",
          "langcode": "en",
          "biography": "<p><strong>Lemon Bucket Orkestra</strong> are Toronto's original guerrilla-folk party-punk massive. The multi-award-winning ensemble has been heralded as a groundbreaking, genre-bending phenomenon by media and fans alike, and over the past 13 years they have performed all over the world from <strong>WOMAD</strong> in England and New Zealand and <strong>Pohoda</strong> in Slovakia, to <strong>Festival D’Été</strong> in Québec City, and <strong>Luminato</strong> in Toronto. <strong>The Guardian</strong> proclaimed that their performances are \"gorgeously sung and passionately played\" and <strong>The New York Times</strong> declared them \"charismatic...handsome and ambitious.”</p>\r\n\r\n<p>Equal parts exhilarating precision and reckless abandon, LBO’s live shows are a truly immersive experience ranging from the ecstatic to the cathartic and all points in between. Now they have been weaving that unique blend of energy and emotion onto their upcoming album <strong>Cuckoo</strong>. Set for release in May 2024, the new record pens strong lines through powerful Ukrainian polyphony, driving Balkan rhythms, and a deep undertone of modern Western sensibilities. This mixture of Eastern Europe and the America's is further elevated with the special feature of Macedonian master trumpeter, hailing from <strong>Kocani Orkestar, Nizo Alimov</strong>.</p>\r\n\r\n<p>The band will be busy <strong>touring US</strong> festivals and PACs in the <strong>Summer of 2024</strong> touting their powerful new album, with a following <strong>Fall Canadian tour</strong>. Along with the worldwide release of the new album, LBO will also be premiering a <strong>new video for their song Freebird</strong>. Filmed on Toronto’s iconic Ward's Island earlier this year, it captures the band in their natural element - taking the viewer through a boisterous, bright, and impassioned journey from a party at the beach to the Balkans. Get on your feet and surround yourself in this sonic juggernaut if you can. To quote the <strong>Winnipeg Free Press</strong>, the experience will be: \"Amazing, frenetic, gloriously anarchic and ultimately joyous!”</p>\r\n",
          "identifiers": {
            "artsdata": null,
            "isni": null,
            "wikidata": null,
            "atc": 191
          },
          "location": {
            "langcode": "en",
            "country_code": "CA",
            "administrative_area": "ON"
          },
          "networks": [
            {
              "type": "network",
              "nid": 122,
              "name": "Test RPN"
            },
            {
              "type": "network",
              "nid": 10,
              "name": "Atlantic Presenters"
            }
          ],
          "website": "https://www.lemonbucket.com/music"
        }
      }
    ]
  }